import math
    '''Импортирует библиотеку math для получения числа пи'''


def area(r):
    '''
    Вычисляет площадь круга.

            Параметры:
                    r (int): Радиус круга
                    pi - Число пи (3.14...)

            Возвращает:
                    Площадь круга.
    
            Пример вызова:
                    area(10)  
                    3.14 * 10 * 10
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Вычисляет периметр круга.

            Параметры:
                    r (int): Радиус круга
                    pi - Число пи (3.14...)

            Возвращает:
                    Периметр круга.
    
            Пример вызова:
                    area(10)
                    2 * 3.14 * 10
    '''
    return 2 * math.pi * r

