def area(a, b):
    '''
    Вычисляет площадь прямоугольника.

            Параметры:
                    a (int): длина.
                    b (int): ширина.

            Возвращает:
                    Площадь прямоугольника.
    
            Пример вызова:
                    area(10, 20) 
                    10 * 20
    '''
    return a * b

def perimeter(a, b):
    '''
    Вычисляет периметр прямоугольника.

            Параметры:
                    a (int): длина.
                    b (int): ширина.

            Возвращает:
                    Периметр прямоугольника.
    
            Пример вызова:
                    area(10, 20) 
                    2 * (10 + 20)
    '''
    return 2 * (a + b)