
def area(a):
    '''
    Вычисляет площадь квадрата.

            Параметры:
                    a(int): сторона квадрата.

            Возвращает:
                    Площадь квадрата.
    
            Пример вызова:
                    area(10) 
                    10 * 10
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата.

            Параметры:
                    a (int): сторона квадрата.

            Возвращает:
                    Периметр квадрата.
    
            Пример вызова:
                    area(10) 
                    4 * 10
    '''
    return 4 * a
