def area(a, h):
    '''
    Вычисляет площадь треугольника.

            Параметры:
                    a (int): сторона треугольника.
                    h (int): высота треугольника.

            Возвращает:
                    Площадь треугольника.
    
            Пример вызова:
                    area(10, 20) 
                    10 * 20 / 2
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Вычисляет перметр треугольника.

            Параметры:
                    a (int): сторона треугольника.
                    h (int): высота треугольника.

            Возвращает:
                    Периметр треугольника.
    
            Пример вызова:
                    area(10, 20, 15) 
                    10 + 20 + 15
    '''    
    return a + b + c